#include<stdio.h>
#include<stdlib.h>
#include <time.h> //time 함수를 사용하기 위한 헤더파일
#include "./all_made_struted.c"

#define SIZE 50
int map[SIZE][SIZE] = {
    0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,6  //던전하고 제련소 연결 아직 안됨
};



int me[2] = { 1,  1}; // 9 9 내현재 좌표
char input = ' ';

int inven[4][100]; 
int quit_shop;
int shop_list_choice;
int item_choice;
int item_count;
int user_money = 1000;

char shop_list[] [40] = {"기본검","장검","일본도","가죽갑옷","철갑옷","가죽신발","철신발","가죽장갑","철장갑","천망토","면망토","가죽투구","철투구","빨간물약","주황물약","맑은물약","파란물약","하얀물약","무지개물약","해독제","축복주문서","마을이동주문서","순간이동주문서"};

int shop_price[23] = {50,500,10000,50,600,50,600,50,600,50,600,50,600,30,200,1000,50,300,1500,500,2000,200,1000};


void draw()
{
    system("clear");
    for (int y = 0; y < SIZE; y++)
    {
        for(int x = 0; x < SIZE; x++)
        {
            // printf("%d,", map[i][j]);
            if(me[1]==y && (me[0]==x))
            {
                printf("🦸");
            } else if(map[y][x]==1)
            {
                printf("🌲 ");     //벽
            } else if(map[y][x]==0)
            {
                printf("〰️ ");    //공백
            } else if(map[y][x]==2)
            {
                printf("🏪");    // 상가1 a -5,36 
            } else if(map[y][x]==3) 
            {
                printf("⛲");    // 상가2  b -15624 -15624  
            } else if(map[y][x]==4) 
            {
                printf("🏤");    // 상가3   c -12024 -11224  
            } else if(map[y][x]==5) 
            {
                printf("🏭");    // 상가4  d -12824 -17224 
            } else if(map[y][x]==6) 
            {
                printf("⛰️");   // 던젼  e -9424 -9224
            }
            else if(map[y][x] ==7) 
            {
                printf("💰");   // 보관소  e -5 -17224      31 36        보관
            }
        }
        // printf("%d",i);//테스트
        printf("\n");
    }
}

void move() {
    if((input == 'w') && (me[1] > 0))   // w를 입력받고 내 y좌표(반복문에서 i)가 0보다 클때
    {
        me[1]--;
    }
    else if((input == 's') && (me[0] < SIZE-1))  // s를 입력받고 내 y좌표(반복문에서 i)가 9보다 클때
    {
        me[1]++;
    }
    else if((input == 'a') && (me[1] > 0))  // a를 입력받고 내 x좌표(반복문에서 j)가 0보다 클때
    {
        me[0]--;
    }
    else if((input == 'd') && (me[1] < SIZE-1))  // d를 입력받고 내 x좌표(반복문에서 j)가 9보다 클때
    {
        me[0]++;
    }
    input = ' ';
}
        
void shop() {
    // system("clear");
    printf("\t\t\t현재 보유금액: %d\n",user_money);
    printf("구매하실 물건의 카테고리를 선택하세요\n\n");
    printf("1. 무기\n2. 갑옷\n3. 신발\n4. 장갑\n5. 망토\n6. 투구\n7. 물약\n8. 귀환서\n**이동 키 눌러 나가기**\n");
    scanf("%d",&shop_list_choice);
    system("clear");

    while(1)
    {
        if (shop_list_choice == 1){  //무기
            for (int i = 0; i< 3; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 2){ //갑옷
            for (int i = 3; i< 5; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 3){
            for (int i = 5; i< 7; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 4){
            for (int i = 7; i< 9; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 5){
            for (int i = 9; i< 11; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 6){
            for (int i = 11; i< 13; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }        
        else if (shop_list_choice == 7){
            for (int i = 13; i< 21; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 8){
            for (int i = 21; i< 23; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else
            break;
        printf("\n구매하실 상품의 번호를 입력하세요: (나가기: 23)");
        scanf("%d",&item_choice);
        
        if (item_choice ==23){
            break;
        }
        if (item_choice < 0 || item_choice >= 23) {
            printf("유효하지 않은 번호입니다.\n");
            continue;
        }

        printf("수량을 입력하세요: ");
        scanf("%d",&item_count);


        if ((shop_price[item_choice])*item_count > user_money)
            printf("잔액이 부족합니다.\n");
        else{
            printf("%s %d개 구매하였습니다.\n\n",shop_list[item_choice],item_count);
            user_money -= (shop_price[item_choice])*item_count;
            printf("현재 보유금액: %d\n",user_money);
        }

        printf("더 구매 하시겠습니까?: \n0.예\n1.아니오\n");
        scanf("%d",&quit_shop);
        if (quit_shop == 1)
        {
            break;
        }               
    }
}

void church(){
    struct status yongboks_s;
    // yongboks_s = set_status(yongboks_s," 용복이",1,100,10,20,10,10,0,10,10,20,10);  //맨 뒤 3개가 10,10,10이나 초기화 되는지 확인 위해 10,20,10으로 바꿈요
    int stats_sum = yongboks_s.str + yongboks_s.int_ + yongboks_s.dex;
    int church_choice;  //치유 or 스탯초기화
    int church_stats_yn; //스탯초기화 여부
    int church_quit_yn; //종료여부 - 종료시 성소 나감, 아닌경우 초기창
    int user_hp = 30; //임의값
    int user_mp = 5; //임의값
    // int max_user_hp = 100;  //임의값
    // int max_user_mp = 10; //임의값
    
    while(1){
        printf("성소에 도착했습니다.\n");
        printf("치유: 0\n스탯초기화: 1\n\n***이동 키 눌러 나가기***\n");  //맵에서는 이동키 눌러 나가기가 작동됩니다.
        scanf("%d",&church_choice);
        system("clear");

        if (church_choice == 0){  //치유를 선택한 경우
            user_hp =  yongboks_s.hp;  //현재 유저의 hp를 용복스의 최대 hp값으로 바꿔줍니다.
            user_mp = yongboks_s.mp;  //현재 유저의 mp를 용복스의 최대 mp값으로 바꿔줍니다.
            printf("치유되었습니다.\n");
            printf("hp: %d mp: %d\n",user_hp,user_mp);
            printf("---------------------------------\n0. 성소 나가기   1. 초기창으로 돌아가기\n");
            scanf("%d",&church_quit_yn);  
                if (church_quit_yn == 0)  //나가는 경우 완전히 종료
                    break;
                else if (church_quit_yn == 1);  // 루프 돌아서 초기창이 나옵니다.
                    continue;
        }
        if (church_choice == 1){
            printf("스탯의 합계: %d\n",stats_sum);  //현재 스탯의 합계를 구합니다.
            printf("STR: %d INT: %d DEX: %d\n",yongboks_s.str,yongboks_s.int_,yongboks_s.dex);  //초기화전 힘인덱을 출력합니다.
            printf("스탯을 초기화하시겠습니까?\n1.네\n2.아니오(초기창으로 돌아갑니다.)\n");
            scanf("%d",&church_stats_yn);  
            if (church_stats_yn == 1){  //초기화를 선택한 경우
                yongboks_s.str = 10;   //레벨업하면서 찍은 추가 스탯은 level-1로 계산하여 추가로 찍을 수 있게 한다는 가정하에
                yongboks_s.int_= 10;  //10,10,10으로 초기화하겠습니다.
                yongboks_s.dex = 10;
                printf("초기화되었습니다.\n");
                printf("추가로 찍을 수 있는 포인트: %d)\n",stats_sum - 30);  //초기화 전 합계 ex총 40스탯이었다고 한다면 초기값 계 30을 빼고 추가로 찍을 수 있는 포인트를 따로 출력함
                printf("STR: %d INT: %d DEX: %d\n",yongboks_s.str,yongboks_s.int_,yongboks_s.dex);
                printf("---------------------------------\n0. 성소 나가기   1. 초기창으로 돌아가기\n");
                scanf("%d",&church_quit_yn);
                    if (church_quit_yn == 0)
                        break;
                    else if (church_quit_yn == 1);
                        continue;
            }
            if (church_stats_yn == 2)
                continue;
        }       
    }
}
//dddddddddddddddddddddddddddddddddddddssssssssssssssssssssssssssssssssss

void enchant_shop()  
{

    int my_stone = 11;
    int rand_,result;
    int enchant_yn;
    int require_stone = 10;
    char enchant_rand[][10] = {"물","불","자연"}; 
    printf("인챈트 가게 입니다.\n인챈트기 마력응축석 10개가 소모됩니다\n\n");
    printf("보유 마력 응축석: %d\n강화를 진행하시겠습니까?: \n0.아니오  1. 네\n", my_stone);

    scanf("%d",&enchant_yn);
    while(getchar() != '\n');
    if (enchant_yn)
    {
        if(my_stone < 10) printf("재료가 부족합니다.\n");
        else if (my_stone >= 10)
        {
            rand_ = (rand() % 3);
            printf("무기에 %s 속성이 인챈트 되었습니다.\n",enchant_rand[rand_]);
            my_stone -= 10;
            printf("남은 마력응축석:%d",my_stone);
        }
        getchar();

    }
}

void event() {
    if ((me[0] == 36) && (me[1] == 5)) 
    {
        system("clear");
        shop();
        me[0] = 35;
    }
    if ((me[0] == 17) && (me[1] == 17))
    {
        system("clear");
        church();
        me[0] = 16;
    }
    if ((me[0] == 39) && (me[1] == 35))
    {
       system("clear");
        enchant_shop();
        me[0] = 38;
    }
}

int main()
{
    while (input != 'q') 
    {
        draw();
        scanf("%c", &input);
        move();
        event();
    }
    return 0;
}



/* 상점가기
dddddddddddddddddddddddddddddddddddssss
성소가기
ddddddddddddddddssssssssssssssss
인챈트샵
dddddddddddddddddddddddddddddddddddddssssssssssssssssssssssssssssssssss
*/

        
