#include<stdio.h>
#include<stdlib.h>
#include "./all_setting.c"

#include <time.h> //time 함수를 사용하기 위한 헤더파일
#define SIZE 50


struct inven setting_shop(struct inven shop_inven);


int map[SIZE][SIZE] = {
    0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
    1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,6
};


int me[2] = { -5,  36}; // 9 9 내현재 좌표
char input = ' ';

int inven[4][100]; 
int quit_shop;
int shop_list_choice;
int item_choice;
int item_count;
int user_money = 1000;

char shop_list[] [40] = {"기본검","장검","일본도","가죽갑옷","철갑옷","가죽신발","철신발","가죽장갑","철장갑","천망토","면망토","가죽투구","철투구","빨간물약","주황물약","맑은물약","파란물약","하얀물약","무지개물약","해독제","축복주문서","마을이동주문서","순간이동주문서"};

int shop_price[23] = {50,500,10000,50,600,50,600,50,600,50,600,50,600,30,200,1000,50,300,1500,500,2000,200,1000};


void draw()
{
    system("clear");
    for (int y = 0; y < SIZE; y++)
    {
        for(int x = 0; x < SIZE; x++)
        {
            // printf("%d,", map[i][j]);
            if(me[1]==y && (me[0]==x))
            {
                printf("🦸");
            } else if(map[y][x]==1)
            {
                printf("🌲 ");     //벽
            } else if(map[y][x]==0)
            {
                printf("〰️ ");    //공백
            } else if(map[y][x]==2)
            {
                printf("🏪");    // 상가1 a -5,36 
            } else if(map[y][x]==3) 
            {
                printf("⛲");    // 상가2  b -15624 -15624  
            } else if(map[y][x]==4) 
            {
                printf("🏤");    // 상가3   c -12024 -11224  
            } else if(map[y][x]==5) 
            {
                printf("🏭");    // 상가4  d -12824 -17224 
            } else if(map[y][x]==6) 
            {
                printf("⛰️");   // 던젼  e -9424 -9224
            }
        }
        // printf("%d",i);//테스트
        printf("\n");
    }
}

void move() {
    if((input == 'w') && (me[1] > 0))   // w를 입력받고 내 y좌표(반복문에서 i)가 0보다 클때
    {
        me[1]--;
    }
    else if((input == 's') && (me[0] < SIZE-1))  // s를 입력받고 내 y좌표(반복문에서 i)가 9보다 클때
    {
        me[1]++;
    }
    else if((input == 'a') && (me[1] > 0))  // a를 입력받고 내 x좌표(반복문에서 j)가 0보다 클때
    {
        me[0]--;
    }
    else if((input == 'd') && (me[1] < SIZE-1))  // d를 입력받고 내 x좌표(반복문에서 j)가 9보다 클때
    {
        me[0]++;
    }
    input = ' ';
}
        
void shop() {

    struct inven shop_inven;
    shop_inven = setting_shop(shop_inven);


    // system("clear");
    printf("\t\t\t현재 보유금액: %d\n",user_money);
    printf("구매하실 물건의 카테고리를 선택하세요\n\n");
    printf("1. 무기\n2. 갑옷\n3. 신발\n4. 장갑\n5. 망토\n6. 투구\n7. 물약\n8. 귀환서\n**이동 키 눌러 나가기**\n");
    scanf("%d",&shop_list_choice);
    system("clear");
    int my_int =sizeof(shop_inven.sw)/sizeof(struct sword);
    //이런식으로 크기 가져와서 뿌려주면 된다.

    int sw_cnt=0;
    int am_cnt=0;

    while(1)
    {
        if (shop_list_choice == 1){  //무기
            // 샵이 가지고 있는 무기 의 크기만큼 반복한다.
            for(int i=0; i<my_int; i++)
            {
                if(shop_inven.sw[i].index_==-2)
                {
                    sw_cnt++;
                }                
            }
            printf("판매중인 검들목록입니다.");
            for(int i=0; i<sw_cnt; i++)
            {
               printf("%s\n",shop_inven.sw[i].name);
            }

            // for (int i = 0; i< 3; i++){
            //     printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            // }
        }
        else if (shop_list_choice == 2){ //갑옷
            // shop_inven.am[i].name , shop_inve.am[i].price
            // 아머의 갯수
            for(int i=0; i<my_int; i++)
            {
                if(shop_inven.am[i].index_==-2)
                {
                    am_cnt++;
                }
                
            }
            printf("판매중인 방어구들의 목록입니다.\n");
            for(int i=0; i<am_cnt; i++)
            {
               printf("%s\n",shop_inven.am[i].name);

            }

            // for (int i = 3; i< 5; i++){
            //     printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            // }
        }
        else if (shop_list_choice == 3){
            for (int i = 5; i< 7; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 4){
            for (int i = 7; i< 9; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 5){
            for (int i = 9; i< 11; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 6){
            for (int i = 11; i< 13; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }        
        else if (shop_list_choice == 7){
            for (int i = 13; i< 21; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else if (shop_list_choice == 8){
            for (int i = 21; i< 23; i++){
                printf("%d. %s:\t\t(%d GOLD)\n",i,shop_list[i],shop_price[i]);
            }
        }
        else
            break;
        printf("\n구매하실 상품의 번호를 입력하세요: (나가기: 23)");
        scanf("%d",&item_choice);
        
        if (item_choice ==23){
            break;
        }
        if (item_choice < 0 || item_choice >= 23) {
            printf("유효하지 않은 번호입니다.\n");
            continue;
        }

        printf("수량을 입력하세요: ");
        scanf("%d",&item_count);


        if ((shop_price[item_choice])*item_count > user_money)
            printf("잔액이 부족합니다.\n");
        else{
            printf("%s %d개 구매하였습니다.\n\n",shop_list[item_choice],item_count);
            user_money -= (shop_price[item_choice])*item_count;
            printf("현재 보유금액: %d\n",user_money);
        }

        printf("더 구매 하시겠습니까?: \n0.예\n1.아니오\n");
        scanf("%d",&quit_shop);
        if (quit_shop == 1)
        {
            break;
        }               
    }
}

void church(){
    int stats [3] = {1,4,2};  //임의값
    int stats_sum = stats[0] + stats[1] + stats[2];
    char stats_name [] [3] = {"STR","INT","DEX"};
    int church_choice;
    int church_stats_yn;
    int level =5;  //임의값
    int user_hp = 30; //임의값
    int user_mp = 5; //임의값
    int max_user_hp = 100;  //임의값
    int max_user_mp = 10; //임의값

    printf("성소에 도착했습니다.\n");
    printf("치유: 0\n스탯초기화: 1\n\n***이동 키 눌러 나가기***");
    scanf("%d",&church_choice);
    system("clear");

    if (church_choice == 0){
        user_hp = max_user_hp;
        user_mp = max_user_mp;
        printf("치유되었습니다.\n");
        printf("hp: %d mp: %d\n",user_hp,user_mp);
    }
    if (church_choice == 1){
        printf("스탯:\n");
        printf("스탯의 합계: %d\n",stats_sum);
        printf("STR: %d INT: %d DEX: %d\n",stats[0],stats[1],stats[2]);
        printf("스탯을 초기화?\n1.네\n2.아니오\n");
        scanf("%d",&church_stats_yn);
        if (church_stats_yn == 1){
            for (int i=0;i<3;i++){
                stats[i] = 0;
            }
            printf("초기화되었습니다.\n");
            printf("스탯의 합계: %d\n",stats_sum);
            printf("STR: %d INT: %d DEX: %d\n",stats[0],stats[1],stats[2]);
        }
        
    }
}
//dddddddddddddddddddddddddddddddddddddssssssssssssssssssssssssssssssssss

void enchant_shop()  
{
    int my_stone = 11;
    int rand_,result;
    int enchant_yn;
    int require_stone = 10;
    char enchant_rand[][10] = {"물","불","자연"}; 
    printf("인챈트 가게 입니다.\n인챈트기 마력응축석 10개가 소모됩니다\n\n");
    printf("보유 마력 응축석: %d\n강화를 진행하시겠습니까?: \n0.아니오  1. 네\n", my_stone);

    scanf("%d",&enchant_yn);
    while(getchar() != '\n');
    if (enchant_yn)
    {
        if(my_stone < 10) printf("재료가 부족합니다.\n");
        else if (my_stone >= 10)
        {
            rand_ = (rand() % 3);
            printf("무기에 %s 속성이 인챈트 되었습니다.\n",enchant_rand[rand_]);
            my_stone -= 10;
            printf("남은 마력응축석:%d",my_stone);
        }
        getchar();

    }
}

void event() {
    if ((me[0] == 36) && (me[1] == 5)) 
    {
        system("clear");
        shop();
        me[0] = 35;
    }
    if ((me[0] == 17) && (me[1] == 17))
    {
        system("clear");
        church();
        me[0] = 16;
    }
    if ((me[0] == 39) && (me[1] == 35))
    {
       system("clear");
        enchant_shop();
        me[0] = 38;
    }
}


int main()
{
    while (input != 'q') 
    {
        draw();
        scanf("%c", &input);
        move();
        event();
    }
    return 0;
}

